[
  {
    "id": 1,
    "bookname": "The Great Gatsby",
    "bookauthor": "F. Scott Fitzgerald",
    "bookcover": "https://imgix.bustle.com/uploads/image/2018/7/27/057ee9a1-a4a6-4510-9cf6-6f63f08ffd9f-the-great-gatsby-big.jpg?w=646\u0026fit=max\u0026auto=format\u0026q=70",
    "bookrating": 5,
    "bookviews": 2500,
    "bookdetails": "ေရွးအခါက မြန္ဘုရင္အဆက္ဆက္သည္ ေခါင္းေဆးကြ်န္း အေနာက္ေနာင္အရပ္ စေနေထာင့္ရွိ နတ္ေရတြင္းမွ ေရျဖင့္
နန္းတက္ဘိသိတ္မဂၤလာျပဳျခင္း ရန္အေပါင္းကို ေအာင္ျမင္ရန္ ဦးေခါင္းေဆးမဂၤလာျပဳျခင္း ဘုန္းတန္ခိုးတက္ေစရန္ ဦးေခါင္းေဆးမဂၤလာ ျပဳျခင္း မ်ားကိုေဆာင္ရြက္ခဲ႔ၾကသည္။

မြန္ဘုရင္မ်ားသာမက ျမန္မာဘုရင္ ယိုးဒယားဘုရင္ ခမာဘုရင္မ်ားသည္လည္း
ဤေခါင္းေဆးကြ်န္းနတ္ေရတြင္းမွေရျဖင့္ ဦးေခါင္းေဆးမဂၤလာျပဳခဲ႔ၾကသည္။

အေနာ္ရထာမင္းသည္ သထံုျပည္ကို လာေရာက္တိုက္ခိုက္စဥ္က ၿမိဳ႕ကို သိမ္းယူနိုင္စြမ္း မရွိခဲ႔ေပ။ ရာဇသႀကၤန္အမတ္၏ အႀကံေပးခ်က္အရ ပြန္စလိုင္ရွိနတ္ေရတြင္းမွ ေရကို ေဆာင္ယူေစ၍ ဦးေခါင္းေဆး ၿပီးမွသာလွ်င္ သထံုၿမိဳ႕ရွိ ၾကက္မတစ္ဝပ္စာ လြတ္ေနေသာ ေနရာရွိေၾကာင္းသိရၿပီး ၿမိဳ႕ကိုသိမ္းယူနိုင္ခဲ႔သည္။

ေကာဇာသကၠရာဇ္ ၄၆၁ ခုနွစ္တြင္ အေလာင္းစည္သူမင္းသည္ ပြန္စလိုင္ သို႔ေရာက္လာကာ ဦးေခါင္းေဆးမဂၤလာျပဳခဲ႔သည္။

သကၠရာဇ္ ၇၄၀ တြင္ မြန္ဘုရင္ ရာဇဓိရာဇ္ သည္ ပြန္စလိုင္နတ္ေရတြင္းေရျဖင့္ ေခါင္းေဆးဘိသိတ္မဂၤလာျပဳခဲ႔သည္။

ရာဇဓိရာဇ္မင္းသည္သားေတာ္ေဗာေလာက်န္ေဒါ မွေထာင္ထားျခားနားမည္ကိုစိုးရိမ္သျဖင့္ အဲေကာင္းဗိန္ ကို သားေတာ္အားကြပ္မ်က္ရန္ ေစလႊတ္လိုက္သည္။ ေဗာေလာက်န္ေဒါသည္ ေရႊေမာေဓာေစတီ၌မိမိ၏လက္ဝတ္ရတနာမ်ားလွဴဒါန္းၿပီးခမည္းေတာ္အား မသင့္ေသာအႀကံ မျပဳခဲ႔ပါက ေသလြန္ၿပီးေနာက္ ျမန္မာတို႔ဝယ္ ဝင္စားၿပီး ဟံသာဝတီကို အနိုင္ရပါေစေၾကာင္း ဆုေတာင္းခဲ႔သည္။ထို႔ေနာက္ ဖံုမသိန္ ၃ က်ပ္သားကို သံပုရာ နွင့္ ေရာေသာက္ကာသတ္ေသခဲ႔သည္။ ရာဇဓိရာဇ္လည္း ေရႊေမာေဓာေစတီေတာ္ကို ထီးေတာ္မွေျခရင္းအထိေရႊခ်ကာ သံဃာေတာ္မ်ားကိုဆြမ္းကပ္ၿပီး ဘယ္ရန္သူမွကြ်န္ုပ္အားစစ္ျပဳ၍မတိုက္ခိုက္နိုင္ေစရန္ ျပန္လည္ဆုေတာင္းခဲ႔သည္။

အင္းဝဘုရင္ မင္းေဆြ၏ မိဖုရားရွင္မိေနာက္ေခၚမိယာေနွာင္ သည္ ကိုယ္ဝန္ရွိလာေသာအခါ ဒလသရက္သီး မုတၱမေျမသင္းခဲ ႏွင့္ ပြန္စလိုင္နတ္ေရတြင္းေရ ကိုခ်ဥ္ခ်င္းတပ္သျဖင့္ လက္ေဆာင္ပ႑ာနွင့္တကြ လႊတ္၍ေတာင္းေစသည္။

ရာဇဓိရာဇ္လည္း အင္းဝဘုရင္ေတာင္းဆိုေသာ အရာမ်ား မေပးဘဲ အျခားေသာ ေဒသမ်ားမွ သာရွာေဖြေပးလိုက္ေၾကာင္း မြန္ရာဇဝင္မ်ားတြင္ေတြ႔ရသည္။

သကၠရာဇ္ ၈၁၆ ခနွစ္တြင္ မြန္ဘုရင္မႀကီး ရွင္ေစာပုသည္လည္း ပြန္စလိုင္နတ္ေရတြင္း မွေရကို မၾကာခဏ ေဆာင္ယူေစၿပီး မဂၤလာယူဖြယ္ အခမ္းအနားမ်ား နွင့္ ဦးေခါင္းေဆးရာတြင္ အသံုးျပဳခဲ႔သည္။

ဘုရင္မႀကီးရွင္ေစာပုသည္ က်ဳိက္မေရာၿမိဳ႕ ဘုရားႀကီးကို လာေရာက္ျပဳျပင္ တည္ထားစဥ္က လက္ေအာက္ခံၿမိဳ႕ျဖစ္ေသာ ေမာ္လၿမိဳင္ၿမိဳ႕သို႔ ေရာက္ရွိစဥ္ က်ဳိက္သလႅံေစတီေတာ္ အစရွိေသာဘုရားမ်ားကိုလွည့္လည္ဖူးေမွ်ာ္ၿပီး ပြန္စလိုင္သို႔သြားကာ ဦးေဆာင္ေဆးမဂၤလာျပဳခဲ႔ေပမည္။

ေနာက္ပိုင္းတြင္ ပြန္စလိုင္ နတ္ေရတြင္းမွေရကို ေဆာင္ယူေစၿပီး ဟံသာဝတီတြင္ ေခါင္းေဆးေလ႔ ရွိေၾကာင္းသိရသည္။

ဓမၼေစတီမင္းႀကီးသည္လည္း ပြန္စလိုင္သို႔ လာေရာက္ကာ နတ္ေရတြင္းေရျဖင့္ ေခါင္းေဆးခဲ႔သည္။

သကၠရာဇ္ ၉၇၆ ခု တြင္ အေနာက္ဘက္လြန္မင္း သည္ ငဇင္ကာ ေခၚ ဒီဗရစ္တို ၏ သန္လ်င္ကို ေအာင္ေတာ္မူၿပီးေနာက္ မုတၱမစား ဗညားဒလ သည္ ေမာ္လၿမိဳင္အပါအဝင္ အရံၿမိဳ႕ ၃၂ ၿမိဳ႕မွ ၿမိဳ႕စားနယ္စားမ်ားနွင့္အတူ လက္ေဆာင္ပ႑ာ မ်ားပါ ယူေဆာင္၍အေနာက္ဘက္လြန္မင္းထံ ခိုဝင္၏။

အနာက္ဘက္လြန္မင္းသည္ ပြန္စလိုင္တြင္ ေရသဘင္ပြဲက်င္းပ သႀကၤန္ေတာ္ေခၚကာ ေခါင္းေဆးမဂၤလာျပဳၿပီးေနာက္ စစ္နွစ္ေၾကာင္းခ်ီကာ ထားဝယ္ တနသၤာရီ သာမက သုဝန္ခေလာက္ ေသာကၠတဲ ကမန္ပိုက္ ထိေအာင္သိမ္းယူနိုင္ခဲ႔သည္။

မင္းရဲဒိဗၺ ဧခ်င္းတြင္
" … …ေရႊစက္ရိပ္နိႈက္ ဦးေခါင္းဆိုက္၏
မကိုက္ထြတ္ထား မဖုရားလည္း
ဗညားဓမၼရာဇာ မည္သာတထပ္
ျဖဴလွပ္ထီးနန္း က်ယ္ဝန္းမြန္းရ မုတၱမကို
တကြနတ္ရွင္ ေပးၿပီးက်င္မွ ဆင္ကစသည္
ေျပာစည္အုပ္ၾကက္ အေရွ႕ဘက္သို႔
ေရႊစက္ေျပာင္ဝင္း ထိန္ထိန္လင္းမွ်င္
ျမစ္မင္းယွဥ္ၿပိဳင္ ပြန္စလိုင္ဟု ငါးဆိုင္ဆံုက်
ပင္လယ္ဝကို ဘဝေရွးလြန္ က်မ္းဂန္တြင္ပင္
ၾကားမထင္တည့္ မ်ားျဖင့္လႊံ႕ေက်ာ္
ႀကီးဘုန္းေတာ္ေၾကာင့္ မေျမာ္ဘူးေလ
ေျမာ္ရေပရွင့္ ကိုးေထြမ်က္ရွင္ ျခယ္မႊန္းဆင္သား
ေရႊစင္ေပါက္လွ ယည္နတ္သထက္ နရဖုန္းထူ
စီးေတာ္မူ၍ ေနကူေယာင္ျမဴး ေဖာင္နွင့္ကူး၍
ပ်ံ႕ပ်ဴးမင္းလိုက္ ေရႏႈိက္သဘင္ စံပယ္ရႊင္မွ
စစ္လ်င္နွစ္ေၾကာင္း ေထာင္းေထာင္းဒဝယ္
အလြယ္သိမ္းယူ … … … " ဟုေရးသားထားသည္ကိုေတြ႔ရသည္။

သကၠရာဇ္ ၁၁၁၈ တြင္ အေလာင္းမင္းတရားသည္ သန္လ်င္ ကို တိုက္ခိုက္ရာ မေအာင္ျမင္သျဖင့္ ပြန္စလိုင္ေရျဖင့္ ေခါင္းေဆးၿပီးမွသာလွ်င္ အလိုျပည့္ေတာ္မူသည္။

သကၠရာဇ္ ၁၃၀၁ ခုနွစ္တြင္ မႏၲေလးေတာင္ရေသ႔ႀကီးဦးခႏၶီ သည္ သူ၏ေကာင္းမႈျဖစ္ေသာ လြန္ခဲ႔ေသာ ၃ နွစ္ခန္႔က တည္ထားခဲ႔သည့္ ေမာ္လၿမိဳင္ ေတာင္ရိုးတန္းရွိ ဦးခႏၶီမဟာျမတ္မုနိရုပ္ပုြါးေတာ္ကို လာေရာက္ ဖူးေျမာ္ရင္းေခါင္းေဆးကြ်န္း နတ္ေရတြင္းတြင္ ဦးေခါင္းေဆးခဲ႔သည္။

ယခုထက္တိုင္လည္း ေခါင္းေဆးကြ်န္းသို႔ လာေရာက္သူမ်ားသည္ နတ္ေရတြင္းမွေရကို ေဆာင္ယူကာ ေခါင္းေဆးေလ႔ရွိေၾကာင္းသိရသည္။"
  },
  {
    "id": 2,
    "bookname": "To Kill a Mockingbird",
    "bookauthor": "Harper Lee",
    "bookcover": "https://imgix.bustle.com/uploads/image/2018/7/27/685e6aa2-657e-4f9e-8bca-e2502425cf67-to-kill-a-mockingbird-cover-big.jpg?w=646\u0026fit=max\u0026auto=format\u0026q=70",
    "bookrating": 4,
    "bookviews": 2400,
    "bookdetails": "To Kill a Mockingbird is a novel by Harper Lee published in 1960. Instantly successful, widely read in high schools and middle schools in the United States, it has become a classic of modern American literature, winning the Pulitzer Prize. The plot and characters are loosely based on Lee's observations of her family, her neighbors and an event that occurred near her hometown of Monroeville, Alabama, in 1936, when she was 10 years old."
  },
  {
    "id": 3,
    "bookname": "Harry Potter and the Sorcerer's Stone",
    "bookauthor": "J.K. Rowling",
    "bookcover": "https://imgix.bustle.com/uploads/image/2018/7/27/9b094f19-d9e5-4190-8329-e440dd55d0ca-harry_potter_and_the_sorcerers_stone_cover.jpg?w=646\u0026fit=max\u0026auto=format\u0026q=70",
    "bookrating": 5,
    "bookviews": 3000,
    "bookdetails": "Harry Potter and the Philosopher's Stone is a fantasy novel written by British author J. K. Rowling. The first novel in the Harry Potter series and Rowling's debut novel, it follows Harry Potter, a young wizard who discovers his magical heritage on his eleventh birthday, when he receives a letter of acceptance to Hogwarts School of Witchcraft and Wizardry. Harry makes close friends and a few enemies during his first year at the school, and with the help of his friends, Harry faces an attempted comeback by the dark wizard Lord Voldemort, who killed Harry's parents, but failed to kill Harry when he was just 15 months old."
  },
  {
    "id": 4,
    "bookname": "The Catcher in the Rye",
    "bookauthor": "J.D. Salinger",
    "bookcover": "https://imgix.bustle.com/uploads/image/2018/7/27/12574549-8c52-4248-8de9-7a0adff922d2-the-catcher-in-the-rye-big.jpg?w=646\u0026fit=max\u0026auto=format\u0026q=70",
    "bookrating": 3,
    "bookviews": 2800,
    "bookdetails": "The Catcher in the Rye is a story by J. D. Salinger, partially published in serial form in 1945–1946 and as a novel in 1951.[3] It was originally published for adults but has become popular among adolescent readers for its themes of angst and alienation, and as a critique on superficiality in society.[4][5] It has been translated into almost all of the world's major languages.[6] Around one million copies are sold each year, with total sales of more than 65 million books.[7] The novel's protagonist Holden Caulfield has become an icon for teenage rebellion.[8] The novel also deals with complex issues of innocence, identity, belonging, loss, and connection."
  },
  {
    "id": 5,
    "bookname": "The Hobbit",
    "bookauthor": "J.R.R. Tolkien",
    "bookcover": "https://imgix.bustle.com/uploads/image/2018/7/27/728f96bd-c52c-44f8-ae4e-a7514777a0e1-the-hobbit-big.jpg?w=646\u0026fit=max\u0026auto=format\u0026q=70",
    "bookrating": 4,
    "bookviews": 2867,
    "bookdetails": "The Hobbit, or There and Back Again is a children's fantasy novel by English author J. R. R. Tolkien. It was published on 21 September 1937 to wide critical acclaim, being nominated for the Carnegie Medal and awarded a prize from the New York Herald Tribune for best juvenile fiction. The book remains popular and is recognized as a classic in children's literature."
  },
  {
    "id": 6,
    "bookname": "Fahrenheit 451",
    "bookauthor": "Ray Bradbury",
    "bookcover": "https://imgix.bustle.com/uploads/image/2018/7/27/2b022dfc-8744-413f-bb9f-19b7229c81f2-fahrenheit-451.jpg?w=646\u0026fit=max\u0026auto=format\u0026q=70",
    "bookrating": 3,
    "bookviews": 2890,
    "bookdetails": "Fahrenheit 451 is a dystopian novel by American writer Ray Bradbury, first published in 1953. It is regarded as one of his best works.[4] The novel presents a future American society where books are outlawed and \"firemen\" burn any that are found.[5] The book's tagline explains the title: \"Fahrenheit 451 – the temperature at which book paper catches fire, and burns...\" The lead character, Guy Montag, is a fireman who becomes disillusioned with his role of censoring literature and destroying knowledge, eventually quitting his job and committing himself to the preservation of literary and cultural writings."
  }
]
